	   IDENTIFICATION DIVISION.
	      PROGRAM-ID. CRUCE-ARCHIVOS.
	   ENVIRONMENT DIVISION.
		CONFIGURATION SECTION.
		   SOURCE-COMPUTER.           IBM-3083.
		   OBJECT-COMPUTER.           IBM-3083.
		  
						
		INPUT-OUTPUT SECTION.
		FILE-CONTROL.
		
			SELECT INFILE ASSIGN "INFORME.txt"
			ORGANIZATION IS LINE SEQUENTIAL
			STATUS IS FS-INFILE.
			SELECT OUTFILE ASSIGN "CONVERSIO.xml"
			ORGANIZATION IS LINE SEQUENTIAL
			STATUS IS FS-OUTFILE.
					
	   DATA DIVISION.
		
		FILE SECTION.
		FD INFILE.
		01 IN-REG.
			05 IN-NUMERO	PIC X(07).
			05 FILLER		PIC X(01).
			05 IN-COGNOM	PIC X(20).
			05 FILLER		PIC X(01).
			05 IN-ZGEO		PIC X(09).
			05 FILLER		PIC X(01).
			05 IN-CONTADOR 	PIC 9(02).
		FD OUTFILE.
		01 OF-REG.
			05 FILLER		PIC X(8).
			05 OF-NUMERO	PIC X(07).
			05 FILLER		PIC X(09).
			05 FILLER		PIC X(10).
			05 OF-COGNOM	PIC X(20).
			05 FILLER		PIC X(11).
			05 FILLER		PIC X(9).			
			05 OF-ZGEO		PIC X(09).
			05 FILLER		PIC X(10).
			05 FILLER		PIC X(10).
			05 OF-CONTADOR	PIC 9(02).
			05 FILLER		PIC X(11).
		
	  WORKING-STORAGE SECTION.	
		01 WS-DADES.
			05 NUMERO		PIC X(07).
			05 FILLER		PIC X(01).
			05 COGNOM		PIC X(20).
			05 FILLER		PIC X(01).
			05 ZGEO			PIC X(09).
			05 FILLER		PIC X(01).
			05 CONTADOR		PIC 9(02).
			
		01 SWITCH 			PIC X.
			88 FIN-FICHERO		VALUE "S".
			88 NO-FIN-FICHERO	VALUE "N".
		
		01 ESCRIBIR-LINIA.
		   05 FILLER		PIC X(8) VALUE "<NOMBRE>".
           05 WR-NUMERO 	PIC X(7).
		   05 FILLER		PIC X(9) VALUE "</NOMBRE>".
           05 FILLER		PIC X(10) VALUE "<APELLIDO>".
           05 WR-COGNOM 	PIC X(20).
           05 FILLER		PIC X(11) VALUE "</APELLIDO>".
		   05 FILLER		PIC X(9) VALUE "<ZONAGEO>".
           05 WR-ZGEO 		PIC X(09).
		   05 FILLER		PIC X(10) VALUE "</ZONAGEO>".
		   05 FILLER		PIC X(10) VALUE "<CANTIDAD>".
		   05 WR-CONTADOR 	PIC X(02).
		   05 FILLER		PIC X(11) VALUE "</CANTIDAD>".
		   
		01 FS-STATUS.
			05 FS-INFILE	PIC X(02).
			05 FS-OUTFILE	PIC X(02).

	   PROCEDURE DIVISION.
	   
	   INICIO.
	   
	   PERFORM ABRIR-FICHEROS THRU FIN-ABRIR-FICHEROS
	   PERFORM ESCRIBIR-ARCHIVO UNTIL FIN-FICHERO
	   PERFORM FINALIZAR.
	   
	   FIN-INICIO.EXIT.
	   
	   ABRIR-FICHEROS.
	   
	   OPEN INPUT  INFILE
	   OPEN OUTPUT OUTFILE.
	   
	   FIN-ABRIR-FICHEROS.EXIT.
	   
	   LEER-ARCHIVO.
	   
	   SET NO-FIN-FICHERO TO TRUE 
	   READ INFILE INTO IN-REG
		   
            EVALUATE FS-INFILE
               WHEN ZEROES
                   MOVE IN-REG TO WS-DADES
               WHEN 10
                   SET FIN-FICHERO TO TRUE
               WHEN OTHER
                   PERFORM FINALIZAR
               END-EVALUATE.
	   
	   FIN-LEER-ARCHIVO.EXIT.
	   
	   ESCRIBIR-ARCHIVO.
	   
	   PERFORM LEER-ARCHIVO
		   
            EVALUATE FS-INFILE
               WHEN ZEROES
				   MOVE NUMERO 		TO WR-NUMERO
				   MOVE COGNOM 		TO WR-COGNOM
				   MOVE ZGEO  		TO WR-ZGEO
				   MOVE CONTADOR 	TO WR-CONTADOR
				   WRITE OF-REG		FROM ESCRIBIR-LINIA			   
				   
               WHEN 10
                   SET FIN-FICHERO TO TRUE
               WHEN OTHER
                   PERFORM FINALIZAR
               END-EVALUATE.
	   
	   FIN-ESCRIBIR-ARCHIVO.EXIT.
	   
	   FINALIZAR.
	   
	   CLOSE 	INFILE
				OUTFILE
		
	   GOBACK.
	   
	   
