IDENTIFICATION DIVISION.
PROGRAM-ID. CRUCE-ARCHIVOS.
ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.           IBM-3083.
       OBJECT-COMPUTER.           IBM-3083.
	   INPUT-OUTPUT SECTION.
	   FILE-CONTROL.
	   SELECT FITXER1 ASSIGN TO "ENTRADA01.TXT" STATUS IS FS-FITXER1.
	   SELECT FITXER2 ASSIGN TO "ENTRADA02.TXT" STATUS IS FS-FITXER2.
	   SELECT SORTIDA ASSIGN TO "SALIDA.TXT" STATUS IS FS-SORTIDA.

DATA DIVISION.
FILE SECTION.
FD FITXER1
	DATA RECORD IS REG-FITXER1.
	01 REG-FITXER1.
		05 REG-ID1 	PIC 9(3).
		05 REG-NOM 	PIC X(10).
FD FITXER2
	DATA RECORD IS REG-FITXER2.
	01 REG-FITXER2.
		05 REG-ID2 		PIC 9(3).
		05 REG-CUENTA 	PIC X(10).
FD SORTIDA
	DATA RECORD IS REG-SORTIDA.
	01 REG-SORTIDA.
		05 REG-TEXT-SORTIDA 	PIC X(80).
		
WORKING-STORAGE SECTION.
	01 WX-FITXER1.
		05 WX-ID1 PIC 9(3).
		05 WX-NOM PIC X(10).
	01 WX-FITXER2.
		05 WX-ID2 PIC 9(3).
		05 WX-CUENTA PIC X(10).
	01 FS-STATUS.
		05 FS-FITXER1 PIC X(2).
		05 FS-FITXER2 PIC X(2).
		05 FS-SORTIDA PIC X(2).
	01 VARIABLES.
		05 ID1 PIC 9(3).
		05 NOM PIC X(10).
		05 ID2 PIC 9(3).
		05 CUENTA PIC X(10).
		
	01 MISATGES.
		05 MSG-IGUAL.
			10 FILLER PIC X(8) VALUE "LA CLAU ".
			10 MSG-IGUAL-ID1 PIC 9(3).
			10 FILLER PIC X(9) VALUE " AMB NOM ".
			10 MSG-IGUAL-NOM PIC X(10).
			10 FILLER PIC X(30) VALUE " TÉ EL NUMERO DE COMPTE ".
			10 MSG-IGUAL-CUENTA PIC X(10).
		05 MSG-MENOR.
			10 FILLER PIC X(8) VALUE "LA CLAU ".
			10 MSG-MENOR-ID1 PIC 9(3).
			10 FILLER PIC X(24) VALUE " NO TÉ NUMERO DE COMPTE".
		05 MSG-MAJOR.
			10 FILLER PIC X(38) VALUE "NO HI HA TITULAR PEL NUMERO DE COMPTE ".
			10 MSG-MAJOR-CUENTA PIC X(10).
			
	
	88 FINAL-FITXER1 VALUE 'TRUE'.
	88 FINAL-FITXER2 VALUE 'TRUE'.
		
	
	
PROCEDURE DIVISION.
	INICI.
		PERFORM OBRIR-FITXERS THRU 01-FINAL
		PERFORM LLEGIR-FITXER1 THRU 02-FINAL
		PERFORM LLEGIR-FITXER2 THRU 03-FINAL
		PERFORM PROCES THRU 04-FINAL UNTIL FINAL-FITXER1 OR FINAL-FITXER2
		
		GOBACK.
		
		
	OBRIR-FITXERS.
		OPEN INPUT FITXER1
		OPEN INPUT FITXER2
		OPEN OUTPUT SORTIDA.
	01-FINAL. EXIT.
	
	LLEGIR-FITXER1.
		READ FITXER1 INTO WX-FITXER1
		
		EVALUATE FS-FITXER1
			WHEN ZEROES
				MOVE WX-ID1 TO ID1
				MOVE WX-NOM TO NOM
			WHEN 10
				SET FINAL-FITXER1 TO TRUE
				MOVE HIGH-VALUES TO ID1
			WHEN OTHER
				PERFORM 05-FINAL
			END-EVALUATE.
	02-FINAL. EXIT.
	
	LLEGIR-FITXER2.
		READ FITXER2 INTO WX-FITXER2
		
		EVALUATE FS-FITXER2
			WHEN ZEROES
				MOVE WX-ID2 TO ID2
				MOVE WX-CUENTA TO CUENTA
			WHEN 10
				SET FINAL-FITXER2 TO TRUE
				MOVE HIGH-VALUES TO ID2
			WHEN OTHER
				PERFORM 05-FINAL
			END-EVALUATE.
	03-FINAL. EXIT.
	
	PROCES.
		EVALUATE TRUE
			WHEN ID1 = ID2
				MOVE ID1 TO MSG-IGUAL-ID1
				MOVE NOM TO MSG-IGUAL-NOM
				MOVE CUENTA TO MSG-IGUAL-CUENTA
				WRITE REG-SORTIDA FROM MSG-IGUAL
				PERFORM LLEGIR-FITXER1
				PERFORM LLEGIR-FITXER2
				
			WHEN ID1 < ID2
				MOVE ID1 TO MSG-MENOR-ID1
				WRITE REG-SORTIDA FROM MSG-MENOR
				PERFORM LLEGIR-FITXER1
			WHEN ID1 > ID2
				MOVE CUENTA TO MSG-MAJOR-CUENTA
				WRITE REG-SORTIDA FROM MSG-MAJOR
				PERFORM LLEGIR-FITXER2
		END-EVALUATE.
		
	04-FINAL. EXIT.
		
	05-FINAL.
		CLOSE FITXER1
			  FITXER2
		      SORTIDA
		STOP RUN
		GOBACK.
		