	   IDENTIFICATION DIVISION.
	   PROGRAM-ID. TXT-CSV.
	   ENVIRONMENT DIVISION.
	   CONFIGURATION SECTION.
		   SOURCE-COMPUTER.           IBM-3083.
		   OBJECT-COMPUTER.           IBM-3083.
	   INPUT-OUTPUT SECTION.
	   FILE-CONTROL.
			SELECT INFILE ASSIGN TO "INFORME.TXT"
			ORGANIZATION IS LINE SEQUENTIAL
			STATUS IS FS-INFILE.
			SELECT OUTFILE ASSIGN TO "INFORME.CSV"
			ORGANIZATION IS LINE SEQUENTIAL
			STATUS IS FS-OUTFILE.

	   DATA DIVISION.

	   FILE SECTION.
		FD INFILE.
		01 IN-REG.
			05 IN-NUMERO	PIC X(07).
			05 FILLER   	PIC X(01).
			05 IN-COGNOM	PIC X(20).
			05 FILLER   	PIC X(01).
			05 IN-ZGEO  	PIC X(09).
			
		FD OUTFILE.
		01 OF-REG.
			05 OF-NUMERO 	PIC X(07).
			05 FILLER    	PIC X(01).
			05 OF-COGNOM 	PIC X(20).
			05 FILLER    	PIC X(01).
			05 OF-ZGEO   	PIC X(09).
			05 FILLER    	PIC X(01).
			.
	   WORKING-STORAGE SECTION.

		01 WS-DADES.
			05 NUMERO		PIC X(07).
			05 FILLER		PIC X(01).
			05 COGNOM		PIC X(20).
			05 FILLER 		PIC X(01).
			05 ZGEO 		PIC X(09).
			
		01 SWITCH 			PIC X.
			88 FIN-FICHERO		VALUE 'S'.
			88 NO-FIN-FICHERO	VALUE 'N'.
		01 ESCRIBIR-LINIA.
			05 WR-NUMERO	PIC X(07).
			05 WR-FILLER	PIC X(01) VALUE ";".
			05 WR-COGNOM	PIC X(20).
			05 WR-FILLER	PIC X(01) VALUE ";".
			05 WR-ZGEO  	PIC X(09).
			05 WR-FILLER	PIC X(01) VALUE ";".
			
		01 FS-STATUS.
			05 FS-INFILE	PIC X(02).
			05 FS-OUTFILE	PIC X(02).	
			
       PROCEDURE DIVISION.
	   
	   INICIO.

	   OPEN INPUT INFILE
	   OPEN OUTPUT OUTFILE
	   
       PERFORM CONVERSIO UNTIL FIN-FICHERO
	   PERFORM FINALIZAR THRU FINAL-FINALIZAR.
	   FINAL-INICIO.

	   CONVERSIO.
	   READ INFILE INTO IN-REG
	   MOVE IN-REG TO WS-DADES
	   SET NO-FIN-FICHERO TO TRUE
	   EVALUATE FS-INFILE
			WHEN ZEROES
			MOVE NUMERO TO WR-NUMERO
			MOVE COGNOM TO WR-COGNOM
			MOVE ZGEO   TO WR-ZGEO
			WRITE OF-REG FROM ESCRIBIR-LINIA
			WHEN 10
			DISPLAY "FIN FICHERO"
			SET FIN-FICHERO TO TRUE
			WHEN OTHER
			DISPLAY "ERROR OTHER"
			PERFORM FINALIZAR
		   END-EVALUATE.
	   FINAL-CONVERSIO.EXIT.

	   FINALIZAR.

	   CLOSE OUTFILE INFILE
	   GOBACK.
	   FINAL-FINALIZAR.EXIT.
