       IDENTIFICATION DIVISION.
       *> SUMA DE TOTS ELS NUMEROS PARS DE 3 I 5 PER SOTA DE 1000.
       *> RESULTAT 266333
       PROGRAM-ID. PARES35.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01 VARIABLES.
           05 VARIABLE01 PIC 9999 VALUE 3.
           05 SUMA-VARIABLE01    PIC 9999999999.
           05 VARIABLE02 PIC 9999 VALUE 5.
           05 SUMA-VARIABLE02    PIC 9999999999.
       01 SUMA    PIC 9999999999.

       PROCEDURE DIVISION.

       PERFORM UNTIL VARIABLE01 > 999
           ADD VARIABLE01 TO SUMA-VARIABLE01
           ADD 3 TO VARIABLE01
       END-PERFORM

       PERFORM UNTIL VARIABLE02 > 999
           ADD VARIABLE02 TO SUMA-VARIABLE02
           ADD 5 TO VARIABLE02
       END-PERFORM

       COMPUTE SUMA = SUMA-VARIABLE01 + SUMA-VARIABLE02
       DISPLAY "V1 " VARIABLE01
       DISPLAY "V2 " VARIABLE02
       DISPLAY "S1 " SUMA-VARIABLE01
       DISPLAY "S2 " SUMA-VARIABLE02
       DISPLAY SUMA.


       GOBACK.
