	IDENTIFICATION DIVISION.
		PROGRAM-ID. AUTOCOMPETENCIA.
	*> PROGRAMA QUE CALCULA LA SUMA DE TOTES LES POTENCIAS DEL 1 - 1000
	*> DEBUT A LES RESTRICCIONS DE LA LONGITUD DE VARIABLES DE COBOL EL -
	*> - RESULTAT ES DE MOLT LLUNY INTEGRE.
	DATA DIVISION.
	WORKING-STORAGE SECTION.
		01 VARIABLES.
			05 NUMERO		PIC 9(36).
			05 NUMERO01		PIC 9(36) VALUE 1.
			05 RESULTAT		PIC 9(36).
		
	PROCEDURE DIVISION.

	INICIO.

		PERFORM PROCES
		PERFORM FINALIZAR.

	PROCES.

		PERFORM UNTIL NUMERO01 > 1000
			COMPUTE NUMERO = NUMERO01 ** NUMERO01
			COMPUTE RESULTAT = RESULTAT + NUMERO
			ADD 1 TO NUMERO01
		END-PERFORM

		DISPLAY RESULTAT.

		FINALIZAR.

		GOBACK.
