	IDENTIFICATION DIVISION.
	  PROGRAM-ID. CRUCE1-1-1.
	ENVIRONMENT DIVISION.
	CONFIGURATION SECTION.
	   SOURCE-COMPUTER.           IBM-3083.
	   OBJECT-COMPUTER.           IBM-3083.

	*> JOAN COMORERA BASCOMPTE


	*>*************************************************
	*>* AQUEST ES UN PROGRAMA DE CREUAMENT DE FITXERS *
	*>* 1-1-1 EN EL CAS MES SIMPLE EN QUE NO HI HAN   *
	*>* CLAUS REPETIDAS EN CAP DE LES COLUMNAS.       *
	*>*************************************************
					
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
		
		SELECT FITXER1 ASSIGN TO "FITXER1.TXT" STATUS IS FS-FITXER1.
		SELECT FITXER2 ASSIGN TO "FITXER2.TXT" STATUS IS FS-FITXER2.
		SELECT FITXER3 ASSIGN TO "FITXER3.TXT" STATUS IS FS-FITXER3.
		SELECT SORTIDA ASSIGN TO "SORTIDA.TXT" STATUS IS FS-SORTIDA.		
		
	DATA DIVISION.

	FILE SECTION.
	FD FITXER1
		DATA RECORD IS REG-FITXER1.
		01 REG-FITXER1.
			05 REG-ID1 	PIC 9(3).
			05 REG-NOM 	PIC X(10).
	FD FITXER2
		DATA RECORD IS REG-FITXER2.
		01 REG-FITXER2.
			05 REG-ID2 		PIC 9(3).
			05 REG-CUENTA 	PIC X(10).
	FD FITXER3
		DATA RECORD IS REG-FITXER3.
		01 REG-FITXER3.
			05 REG-ID3 		PIC 9(3).
			05 REG-IBAN 	PIC X(10).
	FD SORTIDA
		DATA RECORD IS REG-SORTIDA.
		01 REG-SORTIDA.
			05 REG-TEXT-SORTIDA 	PIC X(96).

		
	WORKING-STORAGE SECTION.
	  
	  
	 01 WX-FITXER1.
		05 WX-ID1 PIC 9(3).
		05 WX-NOM PIC X(10).
	01 WX-FITXER2.
		05 WX-ID2 PIC 9(3).
		05 WX-CUENTA PIC X(10).
	01 WX-FITXER3.
		05 WX-ID3 PIC 9(3).
		05 WX-IBAN PIC X(10).	
	01 FS-STATUS.
		05 FS-FITXER1 PIC X(2).
		05 FS-FITXER2 PIC X(2).
		05 FS-FITXER3 PIC X(2).
		05 FS-SORTIDA PIC X(2).
	01 VARIABLES.
		05 ID1 PIC 9(3).
		05 NOM PIC X(10).
		05 ID2 PIC 9(3).
		05 CUENTA PIC X(10).
		05 ID3 PIC 9(3).
		05 IBAN PIC X(10).
		
	01 MISATGES.
		05 MSG-IGUAL.
			10 FILLER PIC X(10) VALUE " CLAU--->".
			10 MSG-IGUAL-ID1 PIC 9(3).
			10 FILLER PIC X(9) VALUE "  NOM--->".
			10 MSG-IGUAL-NOM PIC X(1).
			10 FILLER PIC X(22) VALUE " NUMERO DE COMPTE---> ".
			10 MSG-IGUAL-CUENTA PIC X(10).
			10 FILLER PIC X(20) VALUE " NUMERO DE IBAN---> ".
			10 MSG-IGUAL-IBAN PIC X(10).

	88 FINAL-FITXER1 VALUE 'TRUE'.
	88 FINAL-FITXER2 VALUE 'TRUE'. 
	88 FINAL-FITXER3 VALUE 'TRUE'. 

	PROCEDURE DIVISION.

	INCICI.

	OPEN INPUT FITXER1 
	OPEN INPUT FITXER2
	OPEN INPUT FITXER3
	OPEN OUTPUT SORTIDA
	
	PERFORM LLEGIR-FITXER1 THRU FINAL-LLEGIR-FITXER1
	PERFORM LLEGIR-FITXER2 THRU FINAL-LLEGIR-FITXER2
	PERFORM LLEGIR-FITXER3 THRU FINAL-LLEGIR-FITXER3
	PERFORM PROCEDIMENT THRU FINAL-PROCEDIMENT

	PERFORM PROCES-FINAL.

	PROCEDIMENT.

	PERFORM UNTIL FINAL-FITXER1
			OR FINAL-FITXER2
			OR FINAL-FITXER3
		
		EVALUATE TRUE
			WHEN ID1 EQUAL ID2 AND ID2 EQUAL ID3
				MOVE ID1 TO MSG-IGUAL-ID1
				MOVE NOM TO MSG-IGUAL-NOM
				MOVE CUENTA TO MSG-IGUAL-CUENTA
				MOVE IBAN TO MSG-IGUAL-IBAN
				WRITE REG-SORTIDA FROM MSG-IGUAL BEFORE ADVANCING 1 LINE
				PERFORM LLEGIR-FITXER1
				PERFORM LLEGIR-FITXER2
				PERFORM LLEGIR-FITXER3
				
			WHEN ID1 > ID2
				PERFORM LLEGIR-FITXER2				
			WHEN ID1 < ID2
				PERFORM LLEGIR-FITXER1
			WHEN ID3 < ID2
				PERFORM LLEGIR-FITXER3
			WHEN ID3 > ID2
				PERFORM LLEGIR-FITXER2
			
			WHEN OTHER
			    NEXT SENTENCE
				
	END-PERFORM.		

	FINAL-PROCEDIMENT.EXIT.

	
	LLEGIR-FITXER1.

	READ FITXER1 INTO WX-FITXER1

	EVALUATE FS-FITXER1
		WHEN ZEROES
			MOVE WX-ID1 TO ID1
			MOVE WX-NOM TO NOM
		WHEN 10
			SET FINAL-FITXER1 TO TRUE
			MOVE HIGH-VALUES TO ID1
		WHEN OTHER
			PERFORM PROCES-FINAL
	END-EVALUATE.

	FINAL-LLEGIR-FITXER1.EXIT.

	
	LLEGIR-FITXER2.

	READ FITXER2 INTO WX-FITXER2

	EVALUATE FS-FITXER2
		WHEN ZEROES
			MOVE WX-ID2 TO ID2
			MOVE WX-CUENTA TO CUENTA
		WHEN 10
			SET FINAL-FITXER2 TO TRUE
			MOVE HIGH-VALUES TO ID2
		WHEN OTHER
			PERFORM PROCES-FINAL
	END-EVALUATE.

	FINAL-LLEGIR-FITXER2.EXIT.

	
	LLEGIR-FITXER3.

	READ FITXER3 INTO WX-FITXER3

	EVALUATE FS-FITXER3
		WHEN ZEROES
			MOVE WX-ID3 TO ID3
			MOVE WX-IBAN TO IBAN
		WHEN 10
			SET FINAL-FITXER3 TO TRUE
			MOVE HIGH-VALUES TO ID3
		WHEN OTHER
			PERFORM PROCES-FINAL
	END-EVALUATE.

	FINAL-LLEGIR-FITXER3.EXIT.


	PROCES-FINAL.

	CLOSE FITXER1 FITXER2 FITXER3 SORTIDA

	STOP RUN
	GOBACK.
	   
	FINAL-PROCES-FINAL.
