	   IDENTIFICATION DIVISION.
	   PROGRAM-ID. XML-TXT.
	   ENVIRONMENT DIVISION.
	   CONFIGURATION SECTION.
		   SOURCE-COMPUTER.           IBM-3083.
		   OBJECT-COMPUTER.           IBM-3083.
	   INPUT-OUTPUT SECTION.
	   FILE-CONTROL.
			SELECT INFILE ASSIGN TO "SIMPLEXML.xml"
			ORGANIZATION IS LINE SEQUENTIAL
			STATUS IS FS-INFILE.
			SELECT OUTFILE ASSIGN TO "SIMPLETXT.txt"
			ORGANIZATION IS LINE SEQUENTIAL
			STATUS IS FS-OUTFILE.

	   DATA DIVISION.

	   FILE SECTION.
		FD INFILE.
		01 IN-REG.
			05 FILLER 		PIC X(09).
			05 FILLER 		PIC X(08).
			05 IN-NUMERO	PIC X(07).
			05 FILLER   	PIC X(09).
			05 FILLER   	PIC X(10).
			05 IN-COGNOM	PIC X(20).
			05 FILLER   	PIC X(10).
			05 FILLER   	PIC X(10).
			05 IN-ZGEO  	PIC X(09).
			05 FILLER		PIC X(10).
			05 FILLER		PIC X(10).
			05 IN-CONTADOR	PIC X(02).
			05 FILLER     	PIC X(11).
			05 FILLER     	PIC X(10).
			
		FD OUTFILE.
		01 OF-REG.
			05 OF-NUMERO 	PIC X(07).
			05 FILLER    	PIC X(01).
			05 OF-COGNOM 	PIC X(20).
			05 FILLER    	PIC X(01).
			05 OF-ZGEO   	PIC X(09).
			05 FILLER    	PIC X(01).
			05 OF-CONTADOR 	PIC X(02).
			
	   WORKING-STORAGE SECTION.

		01 WS-DADES.
			05 FILLER		PIC X(09).
			05 FILLER		PIC X(08).
			05 NUMERO		PIC X(07).
			05 FILLER		PIC X(09).
			05 FILLER		PIC X(10).
			05 COGNOM		PIC X(20).
			05 FILLER 		PIC X(11).
			05 FILLER		PIC X(09).
			05 ZGEO 		PIC X(09).
			05 FILLER 		PIC X(10).
			05 FILLER		PIC X(10).
			05 CONTADOR 	PIC X(02).
			05 FILLER		PIC X(11).
			05 FILLER		PIC X(10).
			
		01 SWITCH 			PIC X.
			88 FIN-FICHERO		VALUE 'S'.
			88 NO-FIN-FICHERO	VALUE 'N'.
		01 ESCRIBIR-LINIA.
			05 WR-NUMERO	PIC X(07).
			05 WR-FILLER	PIC X(01) VALUE SPACES.
			05 WR-COGNOM	PIC X(20).
			05 WR-FILLER	PIC X(01) VALUE SPACES.
			05 WR-ZGEO  	PIC X(09).
			05 WR-FILLER	PIC X(01) VALUE SPACES.
			05 WR-CONTADOR	PIC X(02).
			
		01 FS-STATUS.
			05 FS-INFILE	PIC X(02).
			05 FS-OUTFILE	PIC X(02).	
			
       PROCEDURE DIVISION.
	   
	   INICIO.
	   
	   OPEN OUTPUT OUTFILE
	   OPEN INPUT INFILE
	      
	   
       PERFORM CONVERSIO UNTIL FIN-FICHERO
	   PERFORM FINALIZAR THRU FINAL-FINALIZAR.
	   FINAL-INICIO.

	   CONVERSIO.
	   READ INFILE INTO IN-REG
	   MOVE IN-REG TO WS-DADES
	   SET NO-FIN-FICHERO TO TRUE
	   EVALUATE FS-INFILE
			WHEN ZEROES
			MOVE NUMERO TO WR-NUMERO
			MOVE COGNOM TO WR-COGNOM
			MOVE ZGEO   TO WR-ZGEO
			MOVE CONTADOR TO WR-CONTADOR
			WRITE OF-REG FROM ESCRIBIR-LINIA
			WHEN 10
			DISPLAY "FIN FICHERO"
			SET FIN-FICHERO TO TRUE
			WHEN OTHER
			DISPLAY "ERROR OTHER"
			PERFORM FINALIZAR
		   END-EVALUATE.
	   FINAL-CONVERSIO.EXIT.

	   FINALIZAR.

	   CLOSE OUTFILE INFILE
	   GOBACK.
	   FINAL-FINALIZAR.EXIT.
